/****************************************************************************************
 * 文件名: init_mcu.c
 * 日 期:   2014-6-28
 * 作 者:   上海芯旺微电子技术有限公司
 * 说明：       初始化芯片寄存器
 ****************************************************************************************/
#include "init_mcu.h"
#include "Timer.h"

//;************************************************************************************
//;* 函 数 名:  delay_ms
//;* 函数功能: 延时函数
//;* 入口参数: 无
//;* 返    回:   无
//;************************************************************************************
void delay_ms(unsigned int ms_data)
{
	unsigned int j;
	while(ms_data--)
	{
		j=200;
		_CWDT();
		while(j--)
		{
			_CWDT();
		}
	}
}

//;************************************************************************************
//;* 函 数 名:  delay_us  不准确
//;* 函数功能: 延时函数
//;* 入口参数: 无
//;* 返    回:   无
//;************************************************************************************

void delay_us(unsigned int us_data)
{
	unsigned int j;
	while(us_data--)
	{
		j=1;//200;
		_CWDT();
		while(j--)
		{
			_CWDT();
		}
	}
}

/******************************************************************************
* 函 数 名: init_mcu()
* 函数功能: 触摸配置初始化，请参考规格书寄存器说明
* 入口参数: 无
* 返    回: 无
******************************************************************************/
void Init_Touch(void)
{
#if 0
	//采用VDD作为触摸充电电压源
	CTCTL1 = 0x81;
	VDAC=0x80;
#else
	//采用内部参考电压作为触摸充电电压源
	CTCTL1 	= 0x01;
	VRECTL	=0x92;
	__asm
	;;VDACS=0x40;
		MOVB #0x00
		MOV R0,#0x40
		ORL 0x1A,R0
	__endasm;
	VDAC=0xC0;
#endif
	PT3 = 1;   //T3的触摸中断优先级为高
}

/******************************************************************************
* 函 数 名: Init_Touch_GPIO()
* 函数功能: 初始化
* 入口参数: 无
* 返    回: 无
******************************************************************************/
void Init_Touch_GPIO(void)
{
	/* 端口初始化，设置触摸通道为输入
	 * P1.6 TCH2
	 * p1.5 TCH1
	 * P0.2 PWM LED2
	 * P1.0 PWM LED1
	 * P0.5 IO_DOORSTATE
	 * P1.2 IO_DOORSTATE
	 * P1.1 ADC Power_value
	 */

	TR0 = 0b00110100;
	TR1 = 0b01100111;
	TR2 = 0b00000000;

	TR04 = 1;  //P04（Cx电容引脚）

	//TR05 = 1; //P05设为输入
	IOCL5 = 1; //IOCL5 P05口 使能引脚变化中断

}

/******************************************************************************
* 函 数 名: init_mcu()
* 函数功能: 初始化
* 入口参数: 无
* 返    回: 无
******************************************************************************/
void Init_MCU()
{
	/* 晶振频率选择， 16MHz */
	OSCCTL = 0x70;

	Init_Touch_GPIO();  //IO口初始化  P0中断使能

	//P0LR2 = 1;
	//P1LR0 = 1;

    IPEN = 1;  //使能中断优先级功能
#if (I2C_SLAVE_ENABLE == 1)
    Init_I2C_S();
#endif
#if (USART_DEBUG_EN == 1)
    Init_Usart();
#endif

    Init_Touch();

	AIEH = 1; //使能高优先级中断--触摸中断--对应Interrupt 0
	AIEL = 1; //使能低优先级中断--I2C中断 --对应Interrupt  1

	//OPTR = 0X0F;  //看门狗  预分频器分配给看门狗使用 PSA = 1 分频比为1:128，
    //delay_ms(300);  //系统延时，未改动
	delay_ms(10);

}


/******************************************************************************
* 函 数 名: Init_I2C_S()
* 函数功能: 从模式初始化，工作在中断应答中
* 入口参数: 无
* 返    回: 无
******************************************************************************/
void Init_I2C_S()
{
	SSCIPIN = 0;			//SDA = P00, SCL =P01
	TR00 = 1;				//P00 SDA,设置为输入态
	TR01 = 1;				//P01 SCL,设置为输入态

	/* I2C初始化 */
	SSCICTL0 = 0x36;		//使能IIC端口，使能时钟，IIC从动模式，7位地址
	SSCICTL1 = 0x00;		//禁止广播呼叫地址匹配中断
	SSCIADD = I2C_SLAVE_ADDR;//芯片地址设定
	SSCISTA = 0x00;
	SSCIIF  =0;
	PSSCI = 0;	            // 低优先级
	SSCIIF = 0;	            // 清除标志位
	SSCIIE = 1;             // 使能I2C中断
}

/******************************************************************************
* 函 数 名: Init_Usart()
* 函数功能: 串口初始化，波特率115200, SPLCK --- TX
*                                    SPDAT --- RX
* 入口参数: 无
* 返    回: 无
******************************************************************************/
void Init_Usart()
{
	/***Usart相关寄存器初始化****/
	BRCTL = 0x40;	// 	接收空闲  使用8位计数器，不考虑唤醒是使能和自动波特率检测

	//UARTPIN 在位2
	//UARTPIN=0,RX-P2.3 TX-P1.3   //0x40 = 0x0100 0000
	//UARTPIN=1,RX-P0.0 TX-P0.1   //0x44 = 0x0100 0100

	EUBRGH = 0x00;	// 波特率公式=SCLK/(m*y+1),其中SCLK系统时钟，如这里8M，m为倍频数，见手册，y为8位或16位波特率计数值

	EUBRGL = 0x08; 	// SYNC=0(全双工异步模式),BRG16=0(使用8位波特率发生器),HBRG=1(高速)
	TSCTL = 0x26;  	// 8位 发送，使能发送，全双工异步模式SYNC=0，低速模式HBRG=1，发送移位空,不发送同步间隔符
	RSCTL = 0x90;  	// 串口使能（配置引脚为串行口引脚），8位接收，接收使能，无帧错误，溢出错误，不考虑地址识别和第9位
}

/****************************************************************************************
 * 函数名     ：UART_SendBuf
 * 函数功能：串口发送函数，等待发送标志位清空
 * 入口参数：待发数据
 * 返回          ：无
****************************************************************************************/
void UART_SendBuf(unsigned char SendTemp)
{
	TXSDR = SendTemp;
	while(TXSRS == 0);
}

void USART_Send_num(uint32_t num)
{
	uint8_t s[10];
	uint8_t temp,i;
	uint8_t count = 0;
	if (num > 0)
	{
		while(num > 0){
			temp = num % 10;
			s[count] = temp + 48;  //'0' ASCALL 48
			num = num / 10;
			count++;
		}

		for(i = 0; i <= count/2 - 1; i++)
		{
			temp = s[i];
			s[i] = s[count-i-1];
			s[count-i-1] = temp;
		}

		for(i = 0; i < count; i++)
			UART_SendBuf(s[i]);
		UART_SendBuf('\n');
		//USART_Send(USART2_SFR, &s[0], count);
		//USART_Send(USART2_SFR, "\n", 1);
	}
	else
	{
		UART_SendBuf('0');
		UART_SendBuf('\n');
		//USART_Send(USART2_SFR, "0", 1);
		//USART_Send(USART2_SFR, "\n", 1);
	}
}

/****************************************************************************************
 * 函数名     ：PWM1_Init
 * 函数功能：PWM1周期 = (PP1+1)·Tpwm
 * 			脉冲宽度 = PWM1L·Tpwm
 * 			当T1CLKEN=0时 Tpwm = 4·Tsys·(T1预分频比)
 * 			当T1CLKEN=1时 Tpwm = TINTHF ·(T1预分频比)
 * 			当前配置设置周期8ms，主时钟降频
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/

//void PWM1_Init(void)
//{
//	OSCCTL = 0x30;
//	/***PWM相关寄存器初始化****/
//	T1CTL = 0X31;			//T1预分频比=1，启动T1
//	T1L = 0;
//	T1H = 0;
//	PP1 = 249;				//PWM1的周期寄存器 ，分辨率为255，T=(255+1)*4*(1/4MHz)*1=256us，F=1/T=3.9KHz
//	PWM1L = 0;				//PWM1初始化占空比
//	PWM1ON = 1;				//关闭PWM1、PWM2
//
//	PP2 = 249;				//PWM1的周期寄存器 ，分辨率为255，T=(255+1)*4*(1/4MHz)*1=256us，F=1/T=3.9KHz
//	PWM2L = 0;				//PWM1初始化占空比
//	PWM2ON = 1;				//关闭PWM1、PWM2
//}


